Catalogs/ОбъектыЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ОбъектыЛицевыхСчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЗданияИСооружения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подъезд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подъезды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Суффикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКомнат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖилойФонд</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЖилойНеЖилойФонд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Паркинг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ОбъектыЛицевыхСчетов/Forms/ФормаСписка/Ext/Form/Module.bsl
//////////////////////////////////////////////////////////////////////////////// 
// ОБРАБОТЧИКИ СОБЫТИЙ   
//

// Процедура - обработчик события формы "ПриЗагрузкеДанныхИзНастроекНаСервере".
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		
		Элементы.ГруппаОтборы.Видимость = Ложь;
		ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Здание",	Параметры.Отбор.Владелец,	ЗначениеЗаполнено(Параметры.Отбор.Владелец));
		
	Иначе
		
		ОтборОрганизация	 		= Настройки.Получить("ОтборОрганизация");
		ОтборЗдание		 			= Настройки.Получить("ОтборЗдание");
	
		ОтборПодъезд	 			= Настройки.Получить("ОтборПодъезд");
		ОтборЖилойФонд				= Настройки.Получить("ОтборЖилойФонд");
		
		УстановитьСвязиПараметровВыбора();
		
		ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Здание",			ОтборЗдание,		ЗначениеЗаполнено(ОтборЗдание));
		ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Организация",		ОтборОрганизация,	ЗначениеЗаполнено(ОтборОрганизация));
		
		ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Подъезд",			ОтборПодъезд,		ЗначениеЗаполнено(ОтборПодъезд));
		ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "ЖилойФонд",			ОтборЖилойФонд,		ЗначениеЗаполнено(ОтборЖилойФонд));
	
	КонецЕсли;
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура УстановитьОтбор()
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Организация", ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Здание", ОтборЗдание, ЗначениеЗаполнено(ОтборЗдание));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Подъезд", ОтборПодъезд, ЗначениеЗаполнено(ОтборПодъезд));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЗданиеПриИзменении(Элемент)
	
	УстановитьСвязиПараметровВыбора();
	УстановитьОтбор();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	УстановитьСвязиПараметровВыбора();
	УстановитьОтбор();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодъездПриИзменении(Элемент)
	
	УстановитьСвязиПараметровВыбора();
	УстановитьОтбор();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЖилойФондПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ЖилойФонд", ОтборЖилойФонд, ЗначениеЗаполнено(ОтборЖилойФонд));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПараметровВыбора()
	
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Организация", "ОтборОрганизация", РежимИзмененияСвязанногоЗначения.НеИзменять);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		Элементы.ОтборЗдание.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
		Если ОтборЗдание.Организация <> ОтборОрганизация Тогда
			ОтборЗдание = Справочники.ЗданияИСооружения.ПустаяСсылка();
			ОтборПодъезд = Справочники.Подъезды.ПустаяСсылка();
		КонецЕсли;
	Иначе		
		Элементы.ОтборЗдание.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив());
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
		
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Здание", ОтборЗдание);
	Если Копирование Тогда
		СтруктураПараметров.Вставить("ЗначениеКопирования", Элемент.ТекущаяСтрока);
	КонецЕсли; 	
		
	ОткрытьФорму("Справочник.ОбъектыЛицевыхСчетов.ФормаОбъекта", СтруктураПараметров);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры
